app/Controllers/PemeriksaanController.php

SELECT `kunjungan`.*, `pasien`.`id` as `pasien_id`, `pasien`.`no_rm`, `pasien`.`nik`, `pasien`.`nama_lengkap`, `pasien`.`tanggal_lahir`, `pasien`.`jenis_kelamin`, `pasien`.`jenis_pasien`, `pasien`.`no_bpjs`
FROM `kunjungan`
JOIN `pasien` ON `pasien`.`id`=`kunjungan`.`id_pasien`
WHERE `kunjungan`.`id` = '2'
---
    public function create($id)
    {
        $param['title'] = 'Tambah Data Pemeriksaan';
        $param['pasien']  = $this->kunjunganModel
                            ->join('pasien','pasien.id=kunjungan.id_pasien')
                            ->select('kunjungan.*,pasien.id as pasien_id, pasien.no_rm, pasien.nik, pasien.nama_lengkap, pasien.tempat_lahir,  pasien.pekerjaan, pasien.alamat_lengkap, pasien.tanggal_lahir,
                                pasien.jenis_kelamin, pasien.jenis_pasien, pasien.no_bpjs')
                            ->find($id);